---
type: ConfigurationReloadInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# ConfigurationReloadInfo

`Autodesk.Revit.DB.ConfigurationReloadInfo` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ConfigurationReloadInfo | 2016 | `public ConfigurationReloadInfo ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetConnectivityValidation | 2016 | `public ConnectionValidationInfo GetConnectivityValidation ()` |
| Method | GetCustomDataChangedElements | 2019 | `public ISet < ElementId > GetCustomDataChangedElements ()` |
| Method | GetOutOfDatePartStatus | 2019 | `public ReloadSwapOutInfo GetOutOfDatePartStatus ( int index )` |
| Property | Disconnects | 2016 | `public int Disconnects { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OutOfDatePartCount | 2019 | `public int OutOfDatePartCount { get ; }` |
| Property | ProfileNotAvailable | 2016 | `public bool ProfileNotAvailable { get ; }` |